{
  "title": "이력서",
  "namae": "김도윤",
  "introTitle" : "자기소개",
  "introSection" : "<p>안녕하세요 프론트엔드 개발자 김도윤입니다. 5년간 웹 애플리케이션을 개발을 해오면서 프론트엔드, 백엔드 구분없이 참여해왔습니다.</p><p>그 동안 B2C 프로모션 페이지를 주로 개발 해왔으며 그 외에도 반복작업을 줄이면서, 페이지를 최적화하는데 기여해왔습니다. 그리고 화면에 어떻게 랜더링 하는지 고민을 하는게 재미가 있어 프론트 엔드 분야에 지속적인 관심과 함께 성장을 해왔습니다.</p><p>프론트 엔드 개발 역량을 갖추도록 개발 포럼과 스터디에 참여하고 있으며, 개인 프로젝트를 만들어가며 서비스 구축을 위해 필요한 것이 무엇인지 알아가고 있습니다. 그 동안의 경험을 바탕으로 프론트엔드에 역할로서 원할한 커뮤니케이션을 하여 함께 알아가고 함께 성장할 수 있을거라 생각합니다.</p>",
  "MainCareerTitle" : "주요 경력",
  "MainProjectsTitle" : "프로젝트",
  "SideProjectsTitle" : "사이드 프로젝트",
  "Team Project" : "사이드 팀 프로젝트",
  "Private Project" : "개인 프로젝트",
  "webServicePart" : "웹 서비스 개발실",
  "Tech Stack" : "기술 스택",
  "Used Stack" : "사용 기술",
  "issues" : "주요 과제 : ",
  "participants" : "참여 인원",
  "Service Domain" : "서비스 도메인",
  "Responsibilities" : "담당 업무",
  "Promotion Page Promotion" : "프로모션 페이지 프로젝트",
  "Event Developer" : "이벤트 개발자",
  "BackDev" : "백엔드 개발자",
  "FrontDev" : "프론트엔드 개발자",
  "M Part Developer" : "멤버십 부서 개발자",
  "Marketer" : "마케터",
  "Web Designer" : "웹 디자이너",
  "role" : "역할 및 기여",
  "WS_Role1" : "네이버 페이 프로모션 제작 파트로, 마크업 프로젝트를 받은 이후 부터 배포까지 담당 했습니다.",
  "WS_Role2" : "크게 B2C 유저 참여형 이벤트 프로젝트와 B2B 어드민 프로젝트 두 유형으로 담당 했습니다.",
  "WS_CONT" : "<li><b>프로모션 페이지 프로젝트</b></li><ul><li>B2C 페이지들로 구성된 프로젝트입니다. 유저의 네이버페이 사용을 유도하기 위해 마케터와 협업하여 프로모션 페이지 제작 및 모니터링을 진행합니다.</li><li>사용자의 참여 내역을 DB에 저장하는 기능이 기본 베이스로, 프로젝트 스펙에 따라 타부서 API, crontab, Redis, Elastic Search 등등과 연동하여 제작합니다.</li><li>이벤트 페이지 프로젝트는 PHP7, JavaScript ES5, JQuery, Nginx 로 구성합니다.</li></ul><li><b>프로모션 페이지 관리 어드민 프로젝트</b></li><ul><li>마케터를 위한 B2B 프로젝트이며, 사용자 참여 내역 리더보드, 날짜별 페이지 데이터 저장 기능, 프로젝트 템플릿 관리 등등 여러기능이 들어있습니다.</li><li>기술 스택은 Spring 이며, 중간에 프론트 부분은 JSP 에서 React 로 분리를 했습니다.</li></ul>",
  
  "NSLP" : "네이버 쇼핑라이브 프로모션",
  "NSLP_ROLE" : "<li>쇼핑라이브 홍보 페이지로, 기간마다 다른 쇼핑 라이브 상품이 페이지에 전시할 수 있도록 마케터께 어드민 기능을 제공. 입장한 유저가 어떤 상품을 많이 클릭했는지 지표 기능 지원.</li><li>동료 개발자는 서비스페이지, 본인은 어드민 페이지 위주로 진행. 어드민 폼과 클릭 지표 담당이 분리되어 상호협력구조로 진행.</li><li>어드민에는 입력 폼을 제공하며, 상품이름, 이미지, url 랜딩 주소, 게시 시간, 클릭 지표 키 값, 컨텐츠 슬라이드 여부 등등을 설정 가능.</li><li>한 페이지에 이미지가 많이 들어가므로 성능이슈 우려가 있어, CDN 주소 설정.</li><li>클릭 지표는 ElasticSearch 에 저장스펙을 확인하여 어드민에서 ping 데이터 지표를 리더보드로 반영.</li>",
  "NSLP_CONT" : "성과 : 클릭 지표 기능 구현 및 라이브러리화, 어드민 기능 제공으로 재배포 과정 최소화.",
  
  "NMP": "네이버 멤버십 프로모션",
  "NMP_ROLE" : "<li>멤버십 가입한 유저가 참여 후 친구 초대 코드 발급, 초대한 친구가 멤버십 가입시 포인트 지급하는 이벤트.</li><li>멤버십 가입 콜백 API 제공하고 멤버십 가입여부 API 를 제공 받아,부서간 상호 연동 작업 진행.</li><li>친구 초대 내역 DB 저장, 초대 내용 SNS 공유 기능, 공유한 친구 가입수 리더보드 기능 구현.</li><li>매 접속마다 DB GroupBy 를 요청하지 않도록, Crontab 과 Redis를활용하여 안정적으로 리더보드 기능 구현.</li><li>고객 문의에 상세한 응답이 가능하도록, 사용자가 스크립트를 실행할 때 마다 로그가 전송하도록 기능 구현. ( Apache Lucene 기반 )</li>",
  "NMP_CONT" : "성과 : 답변이 어려운 고객문의 최소화, 리더보드 기능 최적화로 우려하던 과부하 문제 해결",
  
  "PIG" : "사장님 보험 가이드",
  "PIG_ROLE" : "<li>사장님을 대상으로 제작된 페이지로, 어떤 보험에 가입해야 하는지 확인하는 셀프체크 기능이 메인.</li><li>체크 결과내용을 SMS, 메일 전송기능을 지원.</li><li>설문조사를 중단 후 재개하거나 결과를 나중에 다시 볼 수 있도록 TimeStamp 랑 무작위 숫자 조합의 키 값으로 데이터 저장. ( Session은 정합성 및 최적화 이슈로, 이 방식을 채택 )</li><li>설문조사 결과 대시보드를 어드민에 기능 지원.</li><li>메일 및 SMS 발송기능은 발신 주체가 정해져 있어, 라이브러리 대신전용 API 를 발급.</li><li>FAQ 기능 적용을 위해 보험 부서의 API Request로 대응.</li>",
  "PIG_CONT" : "성과 : 공개 첫 주에 셀프 체크 하루 1000회 정도로 많은 관심을 받음.",
  
  "VlP_ROLE" : "<li>VLive 앱에 접속시 처음 보이는 팝업 페이지 제작 지원. 팝업은 상품판매 페이지로 랜딩하는 버튼들로 구성.</li><li>최대 10개 국어를 대응하며, 대응하지 않는 언어로 접속시 영문 페이지로 리다이렉트 적용.</li><li>vlive의 Web / Android / iOS 애플리케이션 환경별 크로스 브라우징 이슈 대응. 테스트 앱으로 트러블 슈팅.</li><li>디자인이 다양하지만 동일한 기능의 페이지라서 개발 프로세스 개선. 디자인이 완성되면, 마케터가 직접 페이지를 생성할 수 있도록 제작 툴구현.</li><li>디자인 산출물이 git 저장소로 push → git 저장소의 리소스를 이벤트 서버로 pull 하도록 어드민에서 원격 으로 실행 → 서비스의 공통 스크립트가 서버에 저장된 리소스와 연동.</li>",
  "VlP_CONT" : "성과 : 툴 제작 후 배포 프로세스 최소화.",
  
  "NPP" : "네이버 페이 프로모션",
  "NPP_ROLE" : "<li>대부분의 이벤트 페이지의 기본 구조이며, 유저 참여 내역을 DB 에 저장.</li><li>참여시 지급될 네이버 페이 혜택을 광고 하는 페이지를 주기적으로 제작.</li><li>마크업 산출물 에서 프론트 및 백엔드 로직 스크립트 적용. 필요에 따라 slick, swiper와 같은 라이브러리 적용.</li><li>서비스에서 회원의 참여 내역을 MySQL DB 에 저장하고, 어드민에서는 DB 내용을 열람할 수 있도록 기능 구현.</li>",
  
  "IP_Intro" : "CS 질문을 연습하여 기술면접 대비할 수 있는 앱 애플리케이션",
  "IP_Issue" : "<li>React Context에 JWT 토큰 저장 기능 구현</li><li>컴포넌트 구조화 및 최적화에 집중.</li><li>Rest API Request 의 잦은 요청으로, 보일러 플레이트를 줄이기 위해 커스텀 훅 적용.</li><li>백엔드 측에서 Rest API 를 지원 받으면서 API 연동 진행</li>",

  "revealed" : "배포 링크",
  "Daily Sudoku" : "데일리 스도쿠",
  "DS_Issue" : "<li>SSG 의 장점을 활용할 수 있도록 NextJS 채택.</li><li>타입스크립트는 React 사용의 연습을 목적으로 사용.</li><li>완성 후 기록 제출 기능이 있으며 리더보드 기능을 구현. 리더 보드는 firebase에 연동.</li><li>리더보드의 주기적 갱신이 가능하도록 react-query 채용.</li><li>숫자 칸을 채울 때마다, 너무 많은 검사를 하지 않도록 기능 최적화. (예를들어 이미 틀렸다고 확인된 부분은 다시 검사하지 않음 )</li><li>처음에는, 고정적인 퍼즐 페이지 몇 개 만들기로 했지만 공개 후, 피드백을 받아 일일 무작위 생성 기능을 구현.</li>",
  
  "History" : "학력 및 병역",
  "Bachelor" : "학사 졸업",
  "UNIVERSITY" : "한양대학교 ERICA 캠퍼스",
  "CE" : "컴퓨터 공학과",
  "Army" : "육군",
  "Sergent" : "병장 만기 제대",

  "NC_Socket_Issue" : "<li><a target='_blank' rel='noreferrer' href='https://nnea5215.notion.site/Nomad-Coder-Web-socket-34009eb8a3d644b3ab9c302a2fb06837'>Notion Link</a></li><li>서버와 클라이언트의 지속적인 연결을 가능하게 하는 SocketIO 강의챌린지</li><li>1:1 화상 채팅 앱을 만드는 과정으로 주어진 날짜 간격으로 과제를 완료하며 진행</li><li>모든 과제를 완료하여 수료</li>",
  "NC_TS_ISSUE" : "<li><a target='_blank' rel='noreferrer' href='https://nnea5215.notion.site/Nomad-Coder-TS-aff2bfe0429b4d109f318bf218f8b371'>Notion Link</a></li><li>타입 스크립트 강의 진행하며, 매일 주어진 과제를 해결하는 챌린지 과정</li><li>모든 과제를 완료하여 수료</li><li>이후 모든 개인 프로젝트는 타입스크립트로 전환</li>",
  "Study" : "스터디 활동",

  "Notion Link" : "노션 링크"
}
